<?php
use	core\Router		As	Router;
use	core\Loader		As	Loader;


/*
 * --------------------------------------------------------------------
 * УСТАНАВЛИВАЕМ КОРНЕВУЮ ПАПКУ
 * --------------------------------------------------------------------
 *	раскоментировать нужное
 *
 */
 //	define('ROOT', $_SERVER['DOCUMENT_ROOT'].'/');
 	define('ROOT', str_replace("\\", "/", realpath(__DIR__)).'/');

/*
 * --------------------------------------------------------------------
 *	ОПРЕДЕЛЯЕМ КОНСТАНТЫ
 *	ПОДКЛЮЧАЕМ ФУНКЦИИ
 *	ЗАПУСКАЕМ АВТОЗАГРУЗЧИК
 * --------------------------------------------------------------------
 */
	include_once	ROOT.'core/definition.php';
	include_once	ROOT.'core/spike.php';
	include_once	ROOT.'core/Loader/Autoloader.php';
	/*	
	 *	Регестрируем пользовательскую фунцию как автозагрузку
	 *	route\class::method();
	 */
	Loader\Autoloader::Instance();
	
/*
 * --------------------------------------------------------------------
 * ЗАПУСКАЕМ ПРИЛОЖЕНИЕ , маршрутизатор
 * --------------------------------------------------------------------
 *
 */
	session_save_path(SESSPATH);
	session_start();
	
	
	Router\Router::Instance()->run();
	